
## :white_check_mark: Apply Succeeded (pocket-router-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/5995)



<pre><code>Apply complete! Resources: 53 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
data.aws_region.region: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_caller_identity.caller: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1756567564]
data.aws_kms_alias.kms_alias: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_s3_bucket.application_application_load_balancer_log-bucket_417BB177: Read complete after 0s [id=pocket-data-items-dev]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=3898582139]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 1s [id=ZCSIDA846KWLN]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 1s [id=vpc-012481e83ffa5e152]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "synthetics_synthetics_synthetic_check_access_4C83FECF" {
      + id      = (known after apply)
      + json    = (known after apply)
      + version = "2012-10-17"

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::pocket-syntheticchecks-dev/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListAllMyBuckets",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CloudWatchSynthetics",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # aws_acm_certificate.application_alb_certificate_93966247 will be created
  + resource "aws_acm_certificate" "application_alb_certificate_93966247" {
      + arn                       = (known after apply)
      + domain_name               = "direct.pocket-router.getpocket.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "direct.pocket-router.getpocket.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "direct.pocket-router.getpocket.dev",
        ]
      + tags                      = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + tags_all                  = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate.application_cdn_certificate_E17B2815 will be created
  + resource "aws_acm_certificate" "application_cdn_certificate_E17B2815" {
      + arn                       = (known after apply)
      + domain_name               = "pocket-router.getpocket.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "pocket-router.getpocket.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "pocket-router.getpocket.dev",
        ]
      + tags                      = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + tags_all                  = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195 will be created
  + resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7 will be created
  + resource "aws_acm_certificate_validation" "application_cdn_certificate_certificate_validation_F216BBC7" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_alb.application_application_load_balancer_alb_05EA9801 will be created
  + resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "ROUTER"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0113cd98b0579a9ce",
          + "subnet-081629325ceaecb2f",
          + "subnet-0e72688834215913c",
          + "subnet-0eac4c4b2463a1653",
        ]
      + tags                                                         = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + tags_all                                                     = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "pocket-data-items-dev"
          + enabled = true
          + prefix  = "server-logs/pocketrouter-dev/alb"
        }
    }

  # aws_alb_listener.application_listener_http_D74EC0ED will be created
  + resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + tags_all          = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.application_listener_https_D31CB055 will be created
  + resource "aws_alb_listener" "application_listener_https_D31CB055" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-1-2017-01"
      + tags              = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + tags_all          = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + status_code  = "503"
            }
        }
    }

  # aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F will be created
  + resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 1
      + tags         = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }
      + tags_all     = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B will be created
  + resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "ROUTER"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
          + "type"        = "blue"
        }
      + tags_all                           = {
          + "environment" = "Dev"
          + "service"     = "PocketRouter"
          + "type"        = "blue"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-012481e83ffa5e152"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 5
          + interval            = 15
          + matcher             = (known after apply)
          + path                = "/.well-known/apollo/server-health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6 will be created
  + resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "120"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = "ROUTER"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2           

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

one.application_base_dns_subhosted_zone_77521D1C: Creating...
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Creating...
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Creating...
aws_cloudwatch_log_group.app-log-group: Creation complete after 0s [id=/Backend/PocketRouter-Dev/ecs/app]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Creating...
aws_iam_role.synthetics_synthetic_check_role_A3A5C38B: Creation complete after 0s [id=pocket-pocketrouter-dev-synthetic-check]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Creation complete after 0s [id=PocketRouter-Dev-TaskRole]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Creating...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Creating...
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Creation complete after 0s [id=PocketRouter-Dev-ECSCodeDeployRole]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Creating...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Creation complete after 0s [id=pocketrouter-dev-app]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Creating...
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Creation complete after 0s [id=a5c5b57c-cfc8-4ea4-9a63-2657550b5bf0:PocketRouter-Dev-ECS]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Creating...
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Creation complete after 1s [id=PocketRouter-Dev-TaskExecutionRole]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Creating...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Creation complete after 1s [id=arn:aws:iam::410318598490:policy/PocketRouter-Dev-TaskRolePolicy]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Creating...
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Creation complete after 0s [id=pocketrouter-dev-app]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Creation complete after 0s [id=PocketRouter-Dev-ECSCodeDeployRole-20240105014324582800000007]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Creating...
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/ROUTER20240105014324080800000005/88b86fb85a008b7f]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Creating...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/ROUTER20240105014323950500000003/aeea2f364460de0c]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Creation complete after 0s [id=arn:aws:iam::410318598490:policy/PocketRouter-Dev-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Creating...
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Creation complete after 0s [id=PocketRouter-Dev-TaskExecutionRole-20240105014324717700000008]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=PocketRouter-Dev]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Creation complete after 0s [id=PocketRouter-Dev-TaskRole-20240105014324788700000009]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=6843a27bec1a86b5587bf2f567585f056140af42]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Creation complete after 0s [id=PocketRouter-Dev-TaskExecutionRole-2024010501432485080000000a]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Creation complete after 0s [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/e95300673ad601ae83b45cd789da961e91bcae23]
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Creation complete after 2s [id=sg-05274ac3c6cc1eaca]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Creating...
aws_alb.application_application_load_balancer_alb_05EA9801: Creating...
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Creation complete after 2s [id=sg-0b100f8443d31a178]
aws_acm_certificate.application_cdn_certificate_E17B2815: Creation complete after 6s [id=arn:aws:acm:us-east-1:410318598490:certificate/3dbc7c5d-9879-4759-b8c6-c1d8697278ab]
aws_acm_certificate.application_alb_certificate_93966247: Creation complete after 6s [id=arn:aws:acm:us-east-1:410318598490:certificate/0aec5c48-b902-4d44-b4e0-9cdcf2954bcb]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Still creating... [10s elapsed]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Still creating... [10s elapsed]
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Still creating... [10s elapsed]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Creation complete after 10s [id=arn:aws:ecs:us-east-1:410318598490:cluster/PocketRouter-Dev]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [10s elapsed]
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Creation complete after 16s [id=pocket-pocketrouter-dev-synthetic-checks]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Creating...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Creating...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=4035653370]
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Creating...
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Creation complete after 0s [id=arn:aws:iam::410318598490:policy/pocket-pocketrouter-dev-synthetic-check-access]
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Creating...
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Creation complete after 0s [id=pocket-pocketrouter-dev-synthetic-check-2024010501434013390000000d]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Still creating... [20s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [20s elapsed]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Still creating... [10s elapsed]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Still creating... [10s elapsed]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Still creating... [30s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [30s elapsed]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Creation complete after 33s [id=Z070090020188TMHLF10V]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Creating...
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Creating...
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Creating...
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Still creating... [20s elapsed]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Still creating... [20s elapsed]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Creation complete after 25s [id=router-dev-uptime-0]
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Creating...
aws_cloudwatch_metric_alarm.synthetics_synthetics_synthetic_check_alarm_uptime_0_3A56DFC7: Creation complete after 0s [id=router-dev-uptime-0]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [40s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [10s elapsed]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Still creating... [10s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [10s elapsed]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Still creating... [30s elapsed]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Creation complete after 31s [id=pocket-pocketrouter-dev-synthetic-checks]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [50s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [20s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [20s elapsed]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Still creating... [20s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m0s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Still creating... [30s elapsed]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Still creating... [30s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [30s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m10s elapsed]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Creation complete after 40s [id=ZCSIDA846KWLN_pocket-router.getpocket.dev_NS]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Still creating... [40s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Still creating... [40s elapsed]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Creation complete after 44s [id=Z070090020188TMHLF10V__de2a34c590c057c39e5e2e6c71ca9546.direct.pocket-router.getpocket.dev._CNAME]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Creating...
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Creation complete after 0s [id=2024-01-05 01:44:10.545 +0000 UTC]
aws_route53_record.application_cdn_certificate_certificate_record_F3EF0357: Creation complete after 45s [id=Z070090020188TMHLF10V__b640b288474236fc5af81f1c96dce3da.pocket-router.getpocket.dev._CNAME]
aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7: Creating...
aws_acm_certificate_validation.application_cdn_certificate_certificate_validation_F216BBC7: Creation complete after 0s [id=2024-01-05 01:44:13.203 +0000 UTC]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m20s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m30s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m40s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [1m50s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m0s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m10s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m20s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m30s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m40s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Still creating... [2m50s elapsed]
aws_alb.application_application_load_balancer_alb_05EA9801: Creation complete after 2m52s [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/ROUTER2024010501432622660000000b/7393344950735cde]
aws_route53_record.application_alb_record_8EA9D3F9: Creating...
aws_alb_listener.application_listener_http_D74EC0ED: Creating...
aws_alb_listener.application_listener_https_D31CB055: Creating...
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Creating...
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Creating...
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Creation complete after 0s [id=PocketRouter-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_cloudwatch_metric_alarm.application_alarm-httpresponsetime_9124C30A: Creation complete after 0s [id=PocketRouter-Dev-Alarm-HTTPResponseTime]
aws_alb_listener.application_listener_http_D74EC0ED: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/ROUTER2024010501432622660000000b/7393344950735cde/99dad3bfc6400ce8]
aws_alb_listener.application_listener_https_D31CB055: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/ROUTER2024010501432622660000000b/7393344950735cde/0be38694c26628f4]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Creating...
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Creation complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/ROUTER2024010501432622660000000b/7393344950735cde/0be38694c26628f4/aca1309e467c770d]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creating...
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Creation complete after 1s [id=arn:aws:ecs:us-east-1:410318598490:service/PocketRouter-Dev/PocketRouter-Dev]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Creating...
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creating...
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Creating...
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Creation complete after 0s [id=service/PocketRouter-Dev/PocketRouter-Dev]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Creating...
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Creation complete after 1s [id=PocketRouter-Dev]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Creation complete after 1s [id=PocketRouter-Dev-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Creating...
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Creation complete after 1s [id=PocketRouter-Dev-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Creating...
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Creation complete after 0s [id=PocketRouter-Dev Service High CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Creation complete after 0s [id=PocketRouter-Dev Service Low CPU]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Creation complete after 1s [id=ff3b43f1-93fc-42c7-8440-dd238cb860e5]
aws_route53_record.application_alb_record_8EA9D3F9: Still creating... [10s elapsed]
aws_route53_record.application_alb_record_8EA9D3F9: Still creating... [20s elapsed]
aws_route53_record.application_alb_record_8EA9D3F9: Still creating... [30s elapsed]
aws_route53_record.application_alb_record_8EA9D3F9: Still creating... [40s elapsed]
aws_route53_record.application_alb_record_8EA9D3F9: Creation complete after 41s [id=Z070090020188TMHLF10V_direct.pocket-router.getpocket.dev_A_1]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Creating...
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [10s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [20s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [30s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [40s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [50s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m0s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m10s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m20s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m30s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m40s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [1m50s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m0s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m10s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m20s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m30s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m40s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [2m50s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [3m0s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Still creating... [3m10s elapsed]
aws_cloudfront_distribution.application_cloudfront_distribution_B95C3E21: Creation complete after 3m18s [id=EB81TMAWC5GJ1]
aws_route53_record.application_cdn_record_B2BBECBB: Creating...
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [10s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [20s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [30s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [40s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [50s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Still creating... [1m0s elapsed]
aws_route53_record.application_cdn_record_B2BBECBB: Creation complete after 1m1s [id=Z070090020188TMHLF10V_pocket-router.getpocket.dev_A_2]

Apply complete! Resources: 53 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"3691522d-3311-42c0-bdf4-f7888349521e","JobName":"pocket-router_infrastructure_apply_dev","PRNumber":41,"Program":"tfcmt","SHA1":"c690868f1c0364f8673f9959c08188728c128c09","Target":"pocket-router-cdk-dev","Vars":{}} -->